# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 6  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

head:
  [
   [ 4, 1, DODConv, [ 256, 1, 1 ] ], #10
   [ 6, 1, DODConv, [ 512, 1, 1 ] ], #11
   [ 9, 1, DODConv, [ 1024, 1, 1 ] ], #12

   [ 10, 1, Conv, [ 64, 1, 1 ] ], # 13##
   [ 11, 1, Conv, [ 128, 1, 1 ] ], # 14##
   [ 12, 1, Conv, [ 512, 1, 1 ] ], # 15##

   [[13, 14, 15], 1, AsymptoticFPN, [64, 0]], # 16
   [[13, 14, 15], 1, AsymptoticFPN, [128, 1]], # 17
   [[13, 14, 15], 1, AsymptoticFPN, [512, 2]], # 18

   [ 16, 1, RepConv, [128] ], # 19
   [ 17, 1, RepConv, [256] ], # 20
   [ 18, 1, RepConv, [512] ], # 21

   [19, 1, C3, [256, False]],  # 22 (P3/8-small)
   [20, 1, C3, [512, False]],  # 23 (P4/16-medium)
   [21, 1, C3, [1024, False]],  # 24 (P5/32-large)
  [[22, 23, 24], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]