# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 6  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, repeats, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, ConvNextv2_Attention, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, ConvNextv2_Attention, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, ConvNextv2_Attention, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, ConvNextv2_Attention, [1024]],
   [-1, 1, SPPF, [1024, 5]],
  ]  # 9

# YOLOv8.0n AFPN head
head:
  [
   [ 4, 1, Conv, [ 64, 1, 1 ] ], # 10
   [ 6, 1, Conv, [ 128, 1, 1 ] ], # 11
   [ 9, 1, Conv, [ 512, 1, 1 ] ], # 12

   [[10, 11, 12], 1, AsymptoticFPN, [64, 0]], # 13
   [[10, 11, 12], 1, AsymptoticFPN, [128, 1]], # 14
   [[10, 11, 12], 1, AsymptoticFPN, [512, 2]], # 15

   [ 13, 1, RepConv, [128] ], # 10
   [ 14, 1, RepConv, [256] ], # 11
   [ 15, 1, RepConv, [512] ], # 12

   [16, 1, C3, [256, False]],  # 16 (P3/8-small)
   [17, 1, C3, [512, False]],  # 17 (P4/16-medium)
   [18, 1, C3, [1024, False]],  # 18 (P5/32-large)
  [[19, 20, 21], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]